In [1]:
import pandas as pd

In [2]:
data=[1,2,3,4,5]

In [4]:
seris=pd.Series(data)

In [5]:
seris

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
### series from dictionary

data={'a':1,'b':2,'c':3,'d':4,'e':5}
pd.Series(data)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
data=[10,20,30]
index=['a','b','c']

In [9]:
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [10]:
#### DataFrame
data={
    'name' :["ABC","DEF","GHI"],
    'age' :[10,20,30],
    'city' :['chn','cbe','tnvl']
}
dta=pd.Series(data)

In [11]:
dta

name     [ABC, DEF, GHI]
age         [10, 20, 30]
city    [chn, cbe, tnvl]
dtype: object

In [12]:
df=pd.DataFrame(data)

In [13]:
df

  name  age  city
0  ABC   10   chn
1  DEF   20   cbe
2  GHI   30  tnvl

In [14]:
import numpy as np

np.array(df)

array([['ABC', 10, 'chn'],
       ['DEF', 20, 'cbe'],
       ['GHI', 30, 'tnvl']], dtype=object)

In [15]:
### Create df from list of dict

data=[
    {'name':'ABC','age' :10,'city': 'chn'},
    {'name':'ABCD','age' :101,'city': 'chn2'}
      ]

df=pd.DataFrame(data)

In [16]:
df

   name  age  city
0   ABC   10   chn
1  ABCD  101  chn2

In [17]:
df=pd.read_csv('data.csv')

In [19]:
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [21]:
df.tail()

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [25]:
data=[
    {'name':'ABC','age' :10,'city': 'chn'},
    {'name':'ABCD','age' :101,'city': 'chn2'}
      ]

df=pd.DataFrame(data)

In [26]:
df["name"]

0     ABC
1    ABCD
Name: name, dtype: object

In [32]:
df.loc[1]

name    ABCD
age      101
city    chn2
Name: 1, dtype: object

In [33]:
df.iloc[1][0]

/tmp/ipykernel_4023499/1019881219.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][0]

'ABCD'

In [34]:
## Accessing specified element

df['name']

0     ABC
1    ABCD
Name: name, dtype: object

In [37]:
df

   name  age  city
0   ABC   10   chn
1  ABCD  101  chn2

In [36]:
df.at[1,'age']

101

In [39]:
## Accessing specified element iat

df.iat[1,1]

101

In [40]:
df['salary']=[1000000,2000000]

In [41]:
df

   name  age  city   salary
0   ABC   10   chn  1000000
1  ABCD  101  chn2  2000000

In [42]:
df.drop("salary")

KeyError: "['salary'] not found in axis"

In [43]:
df.drop("salary",axis=1)

   name  age  city
0   ABC   10   chn
1  ABCD  101  chn2

In [44]:
df

   name  age  city   salary
0   ABC   10   chn  1000000
1  ABCD  101  chn2  2000000

In [45]:
df.drop("salary",axis=1,inplace=True)

In [46]:
df

   name  age  city
0   ABC   10   chn
1  ABCD  101  chn2

In [47]:
df.dtypes

name    object
age      int64
city    object
dtype: object

In [49]:
df.describe()

              age
count    2.000000
mean    55.500000
std     64.346717
min     10.000000
25%     32.750000
50%     55.500000
75%     78.250000
max    101.000000